<a href="https://colab.research.google.com/github/Fasiloc/Python_learn-repo/blob/main/Classes/Day_15_Reading_dataset.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
# importing pandas package
import pandas as pd
import numpy as np

In [ ]:
sample=pd.read_excel("/content/Student List.xlsx")

In [ ]:
sample.head()

  Unnamed: 0      BCA 2021-24  ...        Unnamed: 4 Unnamed: 5
0        S\N     Student Name  ...      Student Name     Gender
1          r  ABHIJITH G NAIR  ...       Navaneeth M       MALE
2          2     ABHISHEK A K  ...  P M WAJID REHMAN       MALE
3          3        ABIN BIJU  ...          ROHITH R       MALE
4          4       ABY CYRIAC  ...      SAI GOVIND S       MALE

[5 rows x 6 columns]

In [ ]:
smp=pd.read_csv('/content/employees.csv')
smp.head()

  FirstName  Gender  Start Date  ... Bonus %  Senior Management             Team
0   Douglas    Male  08-06-1993  ...   6.945               True        Marketing
1    Thomas    Male   3/31/1996  ...   4.170               True              NaN
2     Maria  Female   4/23/1993  ...  11.858              False          Finance
3     Jerry    Male  03-04-2005  ...   9.340               True          Finance
4     Larry    Male   1/24/1998  ...   1.389               True  Client Services

[5 rows x 8 columns]

In [ ]:
#column selection 1
smp.FirstName

0      Douglas
1       Thomas
2        Maria
3        Jerry
4        Larry
        ...
995      Henry
996    Phillip
997    Russell
998      Larry
999     Albert
Name: FirstName, Length: 1000, dtype: object

In [ ]:
#column selection 2
smp['FirstName']

0      Douglas
1       Thomas
2        Maria
3        Jerry
4        Larry
        ...
995      Henry
996    Phillip
997    Russell
998      Larry
999     Albert
Name: FirstName, Length: 1000, dtype: object

In [ ]:
# Multiple colomn selection
smp[['FirstName','Salary']]

    FirstName  Salary
0     Douglas   97308
1      Thomas   61933
2       Maria  130590
3       Jerry  138705
4       Larry  101004
..        ...     ...
995     Henry  132483
996   Phillip   42392
997   Russell   96914
998     Larry   60500
999    Albert  129949

[1000 rows x 2 columns]

In [ ]:
#rows and colomn
smp.shape

(1000, 8)

In [ ]:
#row selection
smp[10:20]

   FirstName  Gender  Start Date  ... Bonus %  Senior Management             Team
10    Louise  Female  08-12-1980  ...  15.132               True              NaN
11     Julie  Female  10/26/1997  ...  12.637               True            Legal
12   Brandon    Male  12-01-1980  ...  17.492               True  Human Resources
13      Gary    Male   1/27/2008  ...   5.831              False            Sales
14  Kimberly  Female   1/14/1999  ...  14.543               True          Finance
15   Lillian  Female  06-05-2016  ...   1.256              False          Product
16    Jeremy    Male   9/21/2010  ...   7.369              False  Human Resources
17     Shawn    Male  12-07-1986  ...   6.414              False          Product
18     Diana  Female  10/23/1981  ...  19.082              False  Client Services
19     Donna  Female   7/22/2010  ...   1.894              False          Product

[10 rows x 8 columns]

In [ ]:
#

In [ ]:
sample1=open("/content/employees.txt")

In [ ]:
print(sample1)

<_io.TextIOWrapper name='/content/employees.txt' mode='r' encoding='UTF-8'>

In [ ]:
# reading data from csv file
data = pd.read_csv("/content/iris.csv")

In [ ]:
data = pd.read_csv("/content/iris.csv")
data.head(10)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa
6           4.6          3.4           1.4          0.3  setosa
7           5.0          3.4           1.5          0.2  setosa
8           4.4          2.9           1.4          0.2  setosa
9           4.9          3.1           1.5          0.1  setosa

In [ ]:
data.tail(10)

     sepal_length  sepal_width  petal_length  petal_width    species
140           6.7          3.1           5.6          2.4  virginica
141           6.9          3.1           5.1          2.3  virginica
142           5.8          2.7           5.1          1.9  virginica
143           6.8          3.2           5.9          2.3  virginica
144           6.7          3.3           5.7          2.5  virginica
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [ ]:
data.loc[10:20,['sepal_length','species']]

    sepal_length species
10           5.4  setosa
11           4.8  setosa
12           4.8  setosa
13           4.3  setosa
14           5.8  setosa
15           5.7  setosa
16           5.4  setosa
17           5.1  setosa
18           5.7  setosa
19           5.1  setosa
20           5.4  setosa

In [ ]:
data.head()
#print (data.head(10))

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [ ]:
data.species

0         setosa
1         setosa
2         setosa
3         setosa
4         setosa
         ...
145    virginica
146    virginica
147    virginica
148    virginica
149    virginica
Name: species, Length: 150, dtype: object

In [ ]:
data['sepal_length']

0      5.1
1      4.9
2      4.7
3      4.6
4      5.0
      ...
145    6.7
146    6.3
147    6.5
148    6.2
149    5.9
Name: sepal_length, Length: 150, dtype: float64

In [ ]:
data[['sepal_length','species']]

     sepal_length    species
0             5.1     setosa
1             4.9     setosa
2             4.7     setosa
3             4.6     setosa
4             5.0     setosa
..            ...        ...
145           6.7  virginica
146           6.3  virginica
147           6.5  virginica
148           6.2  virginica
149           5.9  virginica

[150 rows x 2 columns]

In [ ]:
data[10:20]

    sepal_length  sepal_width  petal_length  petal_width species
10           5.4          3.7           1.5          0.2  setosa
11           4.8          3.4           1.6          0.2  setosa
12           4.8          3.0           1.4          0.1  setosa
13           4.3          3.0           1.1          0.1  setosa
14           5.8          4.0           1.2          0.2  setosa
15           5.7          4.4           1.5          0.4  setosa
16           5.4          3.9           1.3          0.4  setosa
17           5.1          3.5           1.4          0.3  setosa
18           5.7          3.8           1.7          0.3  setosa
19           5.1          3.8           1.5          0.3  setosa

In [ ]:
data.loc[10:20,['sepal_length','species']]

    sepal_length species
10           5.4  setosa
11           4.8  setosa
12           4.8  setosa
13           4.3  setosa
14           5.8  setosa
15           5.7  setosa
16           5.4  setosa
17           5.1  setosa
18           5.7  setosa
19           5.1  setosa
20           5.4  setosa

In [ ]:
data.iloc[10:20,[0,1,3]]

    sepal_length  sepal_width  petal_width
10           5.4          3.7          0.2
11           4.8          3.4          0.2
12           4.8          3.0          0.1
13           4.3          3.0          0.1
14           5.8          4.0          0.2
15           5.7          4.4          0.4
16           5.4          3.9          0.4
17           5.1          3.5          0.3
18           5.7          3.8          0.3
19           5.1          3.8          0.3

In [ ]:
data.iloc[0]

sepal_length       5.1
sepal_width        3.5
petal_length       1.4
petal_width        0.2
species         setosa
Name: 0, dtype: object

In [ ]:
data.iloc[1]

sepal_length       4.9
sepal_width          3
petal_length       1.4
petal_width        0.2
species         setosa
Name: 1, dtype: object

In [ ]:
data.iloc[-1]

sepal_length          5.9
sepal_width             3
petal_length          5.1
petal_width           1.8
species         virginica
Name: 149, dtype: object

In [ ]:
data.iloc[:1]

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa

In [ ]:
data.shape

(150, 5)

In [ ]:
#data.drop([0])
data.drop("sepal_length")

KeyError: ignored